---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Friction
source: html/628746d9-b8fa-a89e-21e9-97085309122d.htm
---
# Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Friction Property

The friction of the duct. Units: (kg/(ft²·s²)).

## Syntax (C#)
```csharp
public double Friction { get; set; }
```